network-tests/v1/oha-results/non-colorized/baseline/pod/podinfo-ha/test-pod-172.20.5.71-64-1000.txt
Started at 2024-03-20-17-31
Summary:
  Success rate:	100.00%
  Total:	180.0015 secs
  Slowest:	0.1897 secs
  Fastest:	0.0013 secs
  Average:	0.0065 secs
  Requests/sec:	999.9918

  Total data:	13.73 MiB
  Size/request:	80
  Size/sec:	78.12 KiB

Response time histogram:
  0.001 [1]      |
  0.020 [166300] |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.039 [4715]   |
  0.058 [3505]   |
  0.077 [2533]   |
  0.096 [1751]   |
  0.114 [677]    |
  0.133 [311]    |
  0.152 [137]    |
  0.171 [57]     |
  0.190 [13]     |

Response time distribution:
  10.00% in 0.0015 secs
  25.00% in 0.0016 secs
  50.00% in 0.0017 secs
  75.00% in 0.0019 secs
  90.00% in 0.0122 secs
  95.00% in 0.0389 secs
  99.00% in 0.0866 secs
  99.90% in 0.1356 secs
  99.99% in 0.1676 secs


Details (average, fastest, slowest):
  DNS+dialup:	0.0027 secs, 0.0006 secs, 0.1057 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0060 secs

Status code distribution:
  [200] 180000 responses
Finished at 2024-03-20-17-34